In [3]:
import duckdb
import pandas as pd

%load_ext sql
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False

%sql duckdb:///:memory:

Deploy Panel apps for free on Ploomber Cloud! Learn more: https://ploomber.io/s/signup

# Clase ternaria para mayo/junio

In [4]:
base_path = 'C:/Users/Federico/Desktop/Maestria Data mining/DM EyF/'
dataset_path = base_path + 'datasets/'
modelos_path = base_path + 'modelos/'
db_path = base_path + 'db/'
dataset_file = 'competencia_02_crudo.csv'


ganancia_acierto = 273000
costo_estimulo = 7000

In [5]:
%%sql
create or replace table competencia_02_crudo as
select
    numero_de_cliente, foto_mes
from read_csv_auto("{{dataset_path + dataset_file}}")

Empty DataFrame
Columns: [Success]
Index: []

In [6]:
%%sql
select * from competencia_02_crudo
where foto_mes = 202106

        numero_de_cliente  foto_mes
0               249221109    202106
1               249221468    202106
2               249223005    202106
3               249228180    202106
4               249232117    202106
...                   ...       ...
164871         1598444941    202106
164872         1598471047    202106
164873         1598515897    202106
164874         1598517059    202106
164875         1598518152    202106

[164876 rows x 2 columns]

In [7]:
%%sql
create or replace table competencia_02_expColab as
with periodos as (
  select distinct foto_mes from competencia_02_crudo
), clientes as (
  select distinct numero_de_cliente from competencia_02_crudo
), todo as (
  select numero_de_cliente, foto_mes from clientes cross join periodos
), clase_ternaria as (
  select
  c.*
    , if(c.numero_de_cliente is null, 0, 1) as mes_0
  , lead(mes_0, 1) over (partition by t.numero_de_cliente order by foto_mes) as mes_1
  , lead(mes_0, 2) over (partition by t.numero_de_cliente order by foto_mes) as mes_2
  , case 
      when mes_2 = 1 then 'CONTINUA'
      when mes_1 = 1 and mes_2 = 0 then 'BAJA+2'
      when mes_1 = 0 and mes_2 = 0 then 'BAJA+1'
      when mes_1 = 0 and mes_2 = 1 then 'CONTINUA'
      else null
    end as clase_ternaria
  from todo t
  left join competencia_02_crudo c using (numero_de_cliente, foto_mes)
) 
select
* EXCLUDE (mes_0, mes_1, mes_2)
from clase_ternaria
where mes_0 = 1

Empty DataFrame
Columns: [Success]
Index: []

In [9]:
%%sql
create or replace table competencia_02_expColab as
select numero_de_cliente
,foto_mes
,clase_ternaria 
from competencia_02_expColab

Empty DataFrame
Columns: [Success]
Index: []

In [10]:
%%sql
PIVOT competencia_02_expColab
on clase_ternaria
USING count(numero_de_cliente)
GROUP BY foto_mes

    foto_mes  BAJA+1  BAJA+2  CONTINUA
0     201901     688     718    123346
1     201902     720     688    124391
2     201903     688     760    124988
3     201904     759     579    125658
4     201905     580     660    126419
5     201906     662     608    127916
6     201907     609     689    129426
7     201908     683     552    131429
8     201909     553     576    133185
9     201910     583     624    135475
10    201911     623     735    137309
11    201912     734     598    139329
12    202001     605     502    142859
13    202002     508     185    146416
14    202003     186     378    148792
15    202004     377     533    148962
16    202005     536     629    150096
17    202006     632     624    152501
18    202007     627     542    154595
19    202008     544     472    156042
20    202009     474     564    157333
21    202010     565     488    158678
22    202011     490     646    159606
23    202012     649     634    160243
24    202101     635     785    160606
25    202102     785    1017    160844
26    202103    1020     981    161684
27    202104     982    1189    161919
28    202105    1189     911    162523
29    202106     908    1074    162894
30    202107       0       0         0
31    202108       0       0         0

In [11]:
%%sql
COPY competencia_02_expColab TO '../../../datasets/competencia_01_expColab.csv' (FORMAT CSV, HEADER TRUE)

Empty DataFrame
Columns: [Success]
Index: []

In [12]:
dataset_file = "competencia_01.csv"
dataset_file_2 ="competencia_01_expColab.csv"## Bajas junio

competencia_1=pd.read_csv(dataset_path + dataset_file)
bajas_competencia_1=pd.read_csv(dataset_path + dataset_file_2)

In [24]:
competencia_1.groupby("foto_mes")["clase_ternaria"].value_counts().reset_index()

    foto_mes clase_ternaria   count
0     202101       CONTINUA  160606
1     202101         BAJA+2     785
2     202101         BAJA+1     635
3     202102       CONTINUA  160844
4     202102         BAJA+2    1017
5     202102         BAJA+1     785
6     202103       CONTINUA  161684
7     202103         BAJA+1    1020
8     202103         BAJA+2     981
9     202104       CONTINUA  161919
10    202104         BAJA+2    1189
11    202104         BAJA+1     982

In [25]:
bajas_competencia_1.groupby("foto_mes")["clase_ternaria"].value_counts().reset_index().tail(20)

    foto_mes clase_ternaria   count
70    202012         BAJA+1     649
71    202012         BAJA+2     634
72    202101       CONTINUA  160606
73    202101         BAJA+2     785
74    202101         BAJA+1     635
75    202102       CONTINUA  160844
76    202102         BAJA+2    1017
77    202102         BAJA+1     785
78    202103       CONTINUA  161684
79    202103         BAJA+1    1020
80    202103         BAJA+2     981
81    202104       CONTINUA  161919
82    202104         BAJA+2    1189
83    202104         BAJA+1     982
84    202105       CONTINUA  162523
85    202105         BAJA+1    1189
86    202105         BAJA+2     911
87    202106       CONTINUA  162894
88    202106         BAJA+2    1074
89    202106         BAJA+1     908

In [13]:
bajas_junio=bajas_competencia_1[bajas_competencia_1["foto_mes"]== 202106][["numero_de_cliente","clase_ternaria"]]

In [14]:
import os 
base_path = 'C:/Users/Federico/Desktop/Maestria Data mining/DM EyF/'
dataset_path = os.path.join(base_path, 'datasets/')

file_name = 'Competencia_01_tagg.csv'
file_path = os.path.join(dataset_path, file_name)


bajas_junio.to_csv(file_path, index=False)